source/3-3-4-bin_sums.org
#+STARTUP:indent
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/styles.css"/>
#+HTML_HEAD_EXTRA: <link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
#+OPTIONS: f:nil author:nil num:1 creator:nil timestamp:nil 
#+TITLE: 3.3.4 Binary Arithmetic
#+AUTHOR: Steve Fone

#+BEGIN_HTML
<div class=ribbon>
<a href="GITHUB URL HERE">Fork me on GitHub</a>
</div>
#+END_HTML
* COMMENT Use as a template
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:

** Research It
:PROPERTIES:
:HTML_CONTAINER_CLASS: research
:END:

** Design It
:PROPERTIES:
:HTML_CONTAINER_CLASS: design
:END:

** Build It
:PROPERTIES:
:HTML_CONTAINER_CLASS: build
:END:

** Test It
:PROPERTIES:
:HTML_CONTAINER_CLASS: test
:END:

** Run It
:PROPERTIES:
:HTML_CONTAINER_CLASS: run
:END:

** Document It
:PROPERTIES:
:HTML_CONTAINER_CLASS: document
:END:

** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:

** Program It
:PROPERTIES:
:HTML_CONTAINER_CLASS: program
:END:

** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:

** Badge It
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:

** Save It
:PROPERTIES:
:HTML_CONTAINER_CLASS: save
:END:

* Binary Sums
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:
*Binary Additions*
- In the binary or base 2 number system, there are only two digits,
  =0= and =1=.
- This means that unlike in the denary number system =1 + 1= does not
  equal =2=, it equals =10=.
- Look at the following rules that apply when adding binary numbers
  together:
  - 0 + 0 = 0
  - 0 + 1 = 1
  - 1 + 0 = 1
  - 1 + 1 = 10 (=0= and =carry the 1=)
  - 1 + 1 + 1 = 11 (=1= and =carry the 1=)

- Binary addition can be performed using column addition. Because the
  largest value, a one-digit binary number can have is 1, anything
  that exceeds this must be carried over to the next column (2) in
  the base-2 place value table:

|----------|-------------------------------------------------------------|
|          |   *32*   |  *16*   |    *8*   |   *4*   |   *2*   |   *1*   |
|----------|----------+---------+----------+---------+---------+---------|
|          |          |         |          |         |         |1        |
|----------+----------+---------+----------+---------+---------+---------|
|*+*       |          |         |          |         |         |1        |
|----------+----------+---------+----------+---------+---------+---------|
|*Answer*  |          |         |          |         |*1*      |*0*      |
|----------+----------+---------+----------+---------+---------+---------|
|=Carried= |          |         |          |         |=1=      |         |

- Look at how =0101= and =0111= have been added together using column
  addition in the example below:

|----------|-------------------------------------------------------------|
|          |   *32*   |  *16*   |    *8*   |   *4*   |   *2*   |   *1*   |
|----------|----------+---------+----------+---------+---------+---------|
|          |          |         |0         |1        |0        |1        |
|----------+----------+---------+----------+---------+---------+---------|
|*+*       |          |         |0         |1        |1        |1        |
|----------+----------+---------+----------+---------+---------+---------|
|*Answer*  |          |         |*1*       |*1*      |*0*      |*0*      |
|----------+----------+---------+----------+---------+---------+---------|
|=Carried= |          |         |=1=       |=1=      |=1=      |         |

- =1 + 1 = 10= and =10 + 1 = 11= so:
- =1 + 1 + 1 = 11=

*Overflow Errors*
- An overflow error occurs when the answer to a binary addition
  equation is larger thab the CPU is capable of handling.
- For example, a CPU with a capacity of 8 bits can handle binary
  numbers upto =11111111=. However, if one more bit was added to give
  =100000000=, a 9-bit answer, the CPU would ignore the =1= and output
  =00000000=, which is incorrect.

*Binary Addition Explained*
- The following video explains how to perform binary addition.
#+BEGIN_html
<iframe width="560" height="315" src="https://www.youtube.com/embed/IRTgHrbyG9Q" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
#+END_html

** Badge It
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:
