pages/3-3-4-bin_sums.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>3.3.4 Binary Arithmetic</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">3.3.4 Binary Arithmetic</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Binary Sums</a>
<ul>
<li><a href="#sec-1-1">Learn It</a></li>
<li><a href="#sec-1-2">Badge It</a>
<ul>
<li><a href="#sec-1-2-1">Silver - Complete the following binary additions:</a></li>
</ul>
</li>
<li><a href="#sec-1-3">Learn It</a>
<ul>
<li><a href="#sec-1-3-1">Binary Shifts</a></li>
</ul>
</li>
<li><a href="#sec-1-4">Badge It</a>
<ul>
<li><a href="#sec-1-4-1">Gold - Write down the results after the following shift operations and write down the decimal values before and after the shifts:</a></li>
</ul>
</li>
<li><a href="#sec-1-5">Badge It</a>
<ul>
<li><a href="#sec-1-5-1">Platinum - Answer the following questions:</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div class=ribbon>
<a href="GITHUB URL HERE">Fork me on GitHub</a>
</div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Binary Sums</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Binary Additions</b>
</p>
<ul class="org-ul">
<li>In the binary or base 2 number system, there are only two digits,
<code>0</code> and <code>1</code>.
</li>
<li>This means that unlike in the denary number system <code>1 + 1</code> does not
equal <code>2</code>, it equals <code>10</code>.
</li>
<li>Look at the following rules that apply when adding binary numbers
together:
<ul class="org-ul">
<li>0 + 0 = 0
</li>
<li>0 + 1 = 1
</li>
<li>1 + 0 = 1
</li>
<li>1 + 1 = 10 (<code>0</code> and <code>carry the 1</code>)
</li>
<li>1 + 1 + 1 = 11 (<code>1</code> and <code>carry the 1</code>)
</li>
</ul>
</li>

<li>Binary addition can be performed using column addition. Because the
largest value, a one-digit binary number can have is 1, anything
that exceeds this must be carried over to the next column (2) in
the base-2 place value table:
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left"><b>32</b></th>
<th scope="col" class="left"><b>16</b></th>
<th scope="col" class="left"><b>8</b></th>
<th scope="col" class="left"><b>4</b></th>
<th scope="col" class="left"><b>2</b></th>
<th scope="col" class="left"><b>1</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>+</b></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Answer</b></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left"><b>1</b></td>
<td class="left"><b>0</b></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>Carried</code></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left"><code>1</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Look at how <code>0101</code> and <code>0111</code> have been added together using column
addition in the example below:
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left"><b>32</b></th>
<th scope="col" class="left"><b>16</b></th>
<th scope="col" class="left"><b>8</b></th>
<th scope="col" class="left"><b>4</b></th>
<th scope="col" class="left"><b>2</b></th>
<th scope="col" class="left"><b>1</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">0</td>
<td class="left">1</td>
<td class="left">0</td>
<td class="left">1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>+</b></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">0</td>
<td class="left">1</td>
<td class="left">1</td>
<td class="left">1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Answer</b></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left"><b>1</b></td>
<td class="left"><b>1</b></td>
<td class="left"><b>0</b></td>
<td class="left"><b>0</b></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>Carried</code></td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left"><code>1</code></td>
<td class="left"><code>1</code></td>
<td class="left"><code>1</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li><code>1 + 1 = 10</code> and <code>10 + 1 = 11</code> so:
</li>
<li><code>1 + 1 + 1 = 11</code>
</li>
</ul>

<p>
<b>Overflow Errors</b>
</p>
<ul class="org-ul">
<li>An overflow error occurs when the answer to a binary addition
equation is larger thab the CPU is capable of handling.
</li>
<li>For example, a CPU with a capacity of 8 bits can handle binary
numbers upto <code>11111111</code>. However, if one more bit was added to give
<code>100000000</code>, a 9-bit answer, the CPU would ignore the <code>1</code> and output
<code>00000000</code>, which is incorrect.
</li>
</ul>

<p>
<b>Binary Addition Explained</b>
</p>
<ul class="org-ul">
<li>The following video explains how to perform binary addition.
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/IRTgHrbyG9Q" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>
