source/3-3-4-bin_sums.org
*** Silver - Complete the following binary additions:
=1=
|----------|----------------------------------------------------------------------------------|
|          |  *128*   |  *64*   |   *32*   |  *16*   |   *8*    |   *4*   |   *2*   |   *1*   |
|----------|----------+---------+----------+---------+----------+---------+---------+---------|
|          |    0     |    0    |    1     |    1    |     1    |    0    |    1    |    1    |
|----------+-------------------------------+---------+----------+---------+---------+---------|
|*+*       |    0     |    1    |    0     |    1    |     0    |    0    |    0    |    1    |
|----------+----------+---------+----------+---------+----------+---------+---------+---------|
|*Answer*  |          |         |          |         |          |         |         |         |
|----------+----------+---------+----------+---------+----------+---------+---------+---------|
|=Carried= |          |         |          |         |          |         |         |         |

=2=
|----------|----------------------------------------------------------------------------------|
|          |  *128*   |  *64*   |   *32*   |  *16*   |   *8*    |   *4*   |   *2*   |   *1*   |
|----------|----------+---------+----------+---------+----------+---------+---------+---------|
|          |    0     |   1     |    0     |   0     |    1     |    1    |    1    |    1    |
|----------+-------------------------------+---------+----------+---------+---------+---------|
|          |    0     |   1     |    0     |   1     |    0     |    1    |    1    |    1    |
|----------+----------+---------+----------+---------+----------+---------+---------+---------|
|*+*       |    1     |   0     |    0     |   1     |    0     |    1    |    0    |    0    |
|----------+----------+---------+----------+---------+----------+---------+---------+---------|
|*Answer*  |          |         |          |         |          |         |         |         |
|----------+----------+---------+----------+---------+----------+---------+---------+---------|
|=Carried= |          |         |          |         |          |         |         |         |

=3=
|----------|----------------------------------------------------------------------------------|
|          |  *128*   |  *64*   |   *32*   |  *16*   |   *8*    |   *4*   |   *2*   |   *1*   |
|----------|----------+---------+----------+---------+----------+---------+---------+---------|
|          |    1     |    1    |    0     |    1    |    0     |    0    |    1    |    1    |
|----------+-------------------------------+---------+----------+---------+---------+---------|
|          |    1     |    1    |    1     |    0    |    1     |    1    |    1    |    1    |
|----------+----------+---------+----------+---------+----------+---------+---------+---------|
|*+*       |    0     |    0    |    0     |    1    |    0     |    1    |    0    |    0    |
|----------+----------+---------+----------+---------+----------+---------+---------+---------|
|*Answer*  |          |         |          |         |          |         |         |         |
|----------+----------+---------+----------+---------+----------+---------+---------+---------|
|=Carried= |          |         |          |         |          |         |         |         |

*/Upload to Data Representation - Binary Arithmetic: Silver on BourneToLearn/*


** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:
