pages/3-3-4-bin_sums.html

<div id="outline-container-sec-1-2" class="outline-3 badge">
<h3 id="sec-1-2">Badge It</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Silver - Complete the following binary additions:</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
<code>1</code>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="right"><b>128</b></th>
<th scope="col" class="right"><b>64</b></th>
<th scope="col" class="right"><b>32</b></th>
<th scope="col" class="right"><b>16</b></th>
<th scope="col" class="right"><b>8</b></th>
<th scope="col" class="right"><b>4</b></th>
<th scope="col" class="right"><b>2</b></th>
<th scope="col" class="right"><b>1</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>+</b></td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Answer</b></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>Carried</code></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
<code>2</code>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="right"><b>128</b></th>
<th scope="col" class="right"><b>64</b></th>
<th scope="col" class="right"><b>32</b></th>
<th scope="col" class="right"><b>16</b></th>
<th scope="col" class="right"><b>8</b></th>
<th scope="col" class="right"><b>4</b></th>
<th scope="col" class="right"><b>2</b></th>
<th scope="col" class="right"><b>1</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>+</b></td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">0</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Answer</b></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>Carried</code></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
<code>3</code>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="right"><b>128</b></th>
<th scope="col" class="right"><b>64</b></th>
<th scope="col" class="right"><b>32</b></th>
<th scope="col" class="right"><b>16</b></th>
<th scope="col" class="right"><b>8</b></th>
<th scope="col" class="right"><b>4</b></th>
<th scope="col" class="right"><b>2</b></th>
<th scope="col" class="right"><b>1</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
<td class="right">1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>+</b></td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">0</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Answer</b></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>Carried</code></td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
<b><i>Upload to Data Representation - Binary Arithmetic: Silver on BourneToLearn</i></b>
</p>
</div>
</div>
</div>
