pages/3-3-4-bin_sums.html


<div id="outline-container-sec-1-3" class="outline-3 learn">
<h3 id="sec-1-3">Learn It</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">Binary Shifts</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>In the binary or base 2 number system, the value of a digit changes
by a power of two, when its place in a number shifts to the left <code>(Multiplied)</code> or
to the right <code>(Divided)</code>
</li>
<li>The following table shows how binary numbers are shift by the power
of two:
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left"><b>Shift Left</b></th>
<th scope="col" class="left"><b>Shift Right</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>Shift 1 Place</b></td>
<td class="left">Multiply by 2</td>
<td class="left">Divide by 2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Shift 2 Places</b></td>
<td class="left">Multiply by 4</td>
<td class="left">Divide by 4</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Shift 3 Places</b></td>
<td class="left">Multiply by 8</td>
<td class="left">Divide by 8</td>
</tr>
</tbody>
</table>


<p>
<b>Shifted to the Left (Multiplication) of a Binary Number)</b>
</p>
<ul class="org-ul">
<li>If the binary number is shifted to the left this is equivalent to
multiplying the number by 2 for each shift to the left.
</li>
<li>For example: If we shift <code>two</code> places to the left:
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>0</b></td>
<td class="left"><b>0</b></td>
<td class="left"><b>0</b></td>
<td class="left"><b>0</b></td>
<td class="left"><code>1</code></td>
<td class="left"><code>1</code></td>
<td class="left"><b>1</b></td>
<td class="left"><b>1</b></td>
</tr>
</tbody>
</table>

<p>
&lt;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;                  
</p>

<ul class="org-ul">
<li><b>This gives us the binary number:</b>
</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>0</b></td>
<td class="left"><b>0</b></td>
<td class="left"><code>1</code></td>
<td class="left"><code>1</code></td>
<td class="left"><b>1</b></td>
<td class="left"><b>1</b></td>
<td class="left"><b>0</b></td>
<td class="left"><b>0</b></td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li><b>(Note: We fill empty binary positions with <code>0s</code> as we shift to the
left)</b>
</li>
<li>The original binary number has a value of <code>15</code> (i.e. 8 + 4 + 2 + 1 =
15).
</li>
<li>After shifting two places to the left the value is <code>60</code> (i.e. 32 +
16 + 8 + 2 + 1 = 15). It is multiplied by <code>4</code> or <b>2<sup>2</sup></b>
</li>
</ul>

<p>
<b>Shifted to the Right (Division) of a Binary Number)</b>
</p>
<ul class="org-ul">
<li>If the binary number is shifted to the right this is equivalent to
dividing the number by 2 for each shift to the left.
</li>
<li>For example: If we shift <code>three</code> places to the right:
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>0</b></td>
<td class="left"><code>1</code></td>
<td class="left"><code>1</code></td>
<td class="left"><code>1</code></td>
<td class="left"><b>0</b></td>
<td class="left"><b>0</b></td>
<td class="left"><b>0</b></td>
<td class="left"><b>0</b></td>
</tr>
</tbody>
</table>

<p>
-&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&gt;                  
</p>

<ul class="org-ul">
<li><b>This gives us the binary number:</b>
</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>0</b></td>
<td class="left"><b>0</b></td>
<td class="left"><b>0</b></td>
<td class="left"><b>0</b></td>
<td class="left"><code>1</code></td>
<td class="left"><code>1</code></td>
<td class="left"><code>1</code></td>
<td class="left"><b>0</b></td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>The original binary number has a value of <code>112</code> (i.e. 64 + 32 + 16 =
112).
</li>
<li>After shifting three places to the right the value is <code>14</code> (i.e. 8 +
4 + 2 = 14). The number was divided by <code>8</code> and becomes <b>2<sup>3</sup></b>
</li>
<li><b>(Note: We fill empty binary positions with <code>0s</code> as we shift to the
right)</b>
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-1-4" class="outline-3 badge">
<h3 id="sec-1-4">Badge It</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">Gold - Write down the results after the following shift operations and write down the decimal values before and after the shifts:</h4>
<div class="outline-text-4" id="text-1-4-1">
<pre class="example">
1. The binary number 11001100 is shifted TWO places to the right.
2. The binary number 00011001 is shifted TWO places to the left.
3. The binary number 11001000 is shifted THREE places to the right.
4. The binary number 00000111 is shifted FOUR places to the left.
5. The binary number 10000000 is shifted FIVE places to the right.
</pre>

<p>
<b><i>Upload to Data Representation - Binary Arithmetic: Gold on BourneToLearn</i></b>
</p>
<br>
<p>
<b>Binary Shift Accuracy with multiplication/division by Powers of 2</b> 
</p>
<ul class="org-ul">
<li>This method gives us an easy way to multiply and divide binary
numbers by powers of 2, but can come at the expense of accuracy.
</li>
<li>For example <code>00000110</code> shifted right twice to divide by 4 would be
<code>00000001</code>. This is the equilvalent of decimal 1, but 6/4 = 1.5.
<ul class="org-ul">
<li>Shifting right one place divides the number by 2.
</li>
<li>Shifting left one place multiplies the number by 2.
</li>
</ul>
</li>
<li>This is equivalent to shifting a decimal number right or left - For
example shifting 12300 right 1230, i.e. It divides the number
by 10. Shifting left multiplies a decimal number by 10.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3 badge">
<h3 id="sec-1-5">Badge It</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1">Platinum - Answer the following questions:</h4>
<div class="outline-text-4" id="text-1-5-1">
<ol class="org-ol">
<li>Computers can encounter overflow when adding binary numbers.
<ul class="org-ul">
<li>i) Give an example of an 8-bit binary addition where an overflow
</li>
</ul>
<p>
occurs?
</p>
<ul class="org-ul">
<li>ii) Explain how a computer deals with the overflow?
</li>
</ul>
</li>
<li>Carry out the following binary additions:
<ul class="org-ul">
<li>i) 00011100 + 01110011 + 01001101
</li>
<li>ii) 11101001 + 01010101 + 11111111
</li>
</ul>
</li>
<li>Complete a 3 place left shift on the binary number: 00011010
</li>
<li>State an appropriate shift to divide a binary number by 4 and use it on: 11010100
</li>
<li>Tim says "Adding a binary number to itself is the same as a 2 place left shift." Is he correct? Explain your answer.
</li>
</ol>

<p>
<b><i>Upload to Data Representation - Binary Arithmetic: Platinum on BourneToLearn</i></b>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>